{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "GraphLiteral",
			"Children": [
				{
					"Source":
					{
						"Text": "0: Unknown"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2229490321"
				},
				{
					"Source":
					{
						"Text": "10: Rock"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3587209621"
				},
				{
					"Source":
					{
						"Text": "11: Sand"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1348125568"
				},
				{
					"Source":
					{
						"Text": "12: Snow"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2920719161"
				},
				{
					"Source":
					{
						"Text": "1: Concrete"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "456269855"
				},
				{
					"Source":
					{
						"Text": "2: Dirt"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2064683932"
				},
				{
					"Source":
					{
						"Text": "3: Water"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4147035396"
				},
				{
					"Source":
					{
						"Text": "4: Metal"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "416663131"
				},
				{
					"Source":
					{
						"Text": "5: Wood"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3899407398"
				},
				{
					"Source":
					{
						"Text": "6: Grass"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3464775400"
				},
				{
					"Source":
					{
						"Text": "7: Glass"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4194012023"
				},
				{
					"Source":
					{
						"Text": "8: Flesh"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1124302097"
				},
				{
					"Source":
					{
						"Text": "9: Leaves"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2581053416"
				},
				{
					"Source":
					{
						"Text": "Default"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "940523119"
				},
				{
					"Source":
					{
						"Text": "EggData"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "789039584"
				},
				{
					"Source":
					{
						"Text": "Harvesting Resource"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3354706518"
				},
				{
					"Source":
					{
						"Text": "HarvestingResource"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4235844654"
				},
				{
					"Source":
					{
						"Text": "Kibble"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "696406108"
				}
			]
		},
		{
			"Namespace": "KismetSchema",
			"Children": [
				{
					"Source":
					{
						"Text": "Default"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "940523119"
				}
			]
		},
		{
			"Namespace": "SCS",
			"Children": [
				{
					"Source":
					{
						"Text": "Default"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "940523119"
				}
			]
		},
		{
			"Namespace": "UObjectCategory",
			"Children": [
				{
					"Source":
					{
						"Text": "Kibble"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "696406108"
				}
			]
		},
		{
			"Namespace": "UObjectToolTips",
			"Children": [
				{
					"Source":
					{
						"Text": "1 for female, 2 for male: any other value results in random selection at spawn time"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1037073192"
				},
				{
					"Source":
					{
						"Text": "AJW: Intercept the saved move combiner and reject the move combining"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "347057486"
				},
				{
					"Source":
					{
						"Text": "ARKNX : GS AR : XB1_StoryTime branch rev 159659 merge"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3237399716"
				},
				{
					"Source":
					{
						"Text": "ARKNX : GS AR : allow blueprints to hook into the proper impulse event driven by the character movement"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3072852500"
				},
				{
					"Source":
					{
						"Text": "ARKNX : GS AR : fail safe that stops ticking the dino after ascension"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2705283541"
				},
				{
					"Source":
					{
						"Text": "ARKNX : GS AR : indicate if we want to force update rate optimizations off"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "965230948"
				},
				{
					"Source":
					{
						"Text": "ARKSWITCH - FIXME : Does bAttachmentReplicationUseNetworkParent flag need to be respected? Figure out its prior use"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1104736544"
				},
				{
					"Source":
					{
						"Text": "ARKSWITCH : Fixme : This was doing stuff with consumed input on pawns in the old engine. Is it still needed?\nAlso, please don't delete variable below, need for BP compatibility regardless"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "365137100"
				},
				{
					"Source":
					{
						"Text": "AS: Allows a character to have dye-able color regions but not the per-pixel painting"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4051839689"
				},
				{
					"Source":
					{
						"Text": "AS: Allows this char to call ModifySavedMoveAcceleration_PostRep() when the server receives a client move"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1294027399"
				},
				{
					"Source":
					{
						"Text": "AS: Allows this char to call ModifySavedMoveAcceleration_PreRep() before replicating a client move to the server"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "174079301"
				},
				{
					"Source":
					{
						"Text": "AS: Allows this character to use BP_ForceAllowBuffClasses to whitelist specific buff classes when bPreventAllBuffs = true"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3825279328"
				},
				{
					"Source":
					{
						"Text": "AS: Controls whether or not this dino will allow any regional colorization, either from random color sets or from players attempting to dye/paint"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4273838361"
				},
				{
					"Source":
					{
						"Text": "AS: Disables IK logic when in any movement mode other than MOVE_Walking"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2824578095"
				},
				{
					"Source":
					{
						"Text": "AS: Enables the BP implementable function BP_OverrideRiderCameraCollisionSweep"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1723111682"
				},
				{
					"Source":
					{
						"Text": "AS: Enables the BP implementable functions BP_OnBasedPawnAddedNotify and BP_OnBasedPawnRemovedNotify"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2194875839"
				},
				{
					"Source":
					{
						"Text": "AS: Forces IK to update while rotating, for dinos that can turn in place on slopes"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3359867837"
				},
				{
					"Source":
					{
						"Text": "AS: Interps the float that smoothly blends the HealthDamageMaterialOverlay alpha to the current health percentage, rather than hard setting on tick (THIS BOOL IS EXPENSIVE, SHOULD ONLY BE ENABLED WHEN YOU NEED IT (FORCES THE DINO MATERIAL TO UPDATE EVERY FRAME))"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "530452444"
				},
				{
					"Source":
					{
						"Text": "AS: Jump Inputs (Leaving these as BP implementable events behind a bool due to legacy dependencies)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2450465491"
				},
				{
					"Source":
					{
						"Text": "Allow each actor to run at a different time speed. The DeltaTime for a frame is multiplied by the global TimeDilation (in WorldSettings) and this CustomTimeDilation for this actor's tick."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "248962970"
				},
				{
					"Source":
					{
						"Text": "Allows this dino to override the camera view target per-frame. Dino logic should enable this only when needed and disable it when not in use."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3841659319"
				},
				{
					"Source":
					{
						"Text": "Allows us to only see this Actor in the Editor, and not in the actual game.\n@see SetActorHiddenInGame()"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4088183814"
				},
				{
					"Source":
					{
						"Text": "Also forces dino to be Remote Dino"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2911459412"
				},
				{
					"Source":
					{
						"Text": "Always relevant for network (overrides bOnlyRelevantToOwner)."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "895176480"
				},
				{
					"Source":
					{
						"Text": "Amount of jump force time remaining, if JumpMaxHoldTime > 0."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4262672825"
				},
				{
					"Source":
					{
						"Text": "Anim used instead of HurtAnim when flying. If one is not specified, HurtAnim will be used while flying."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1674543660"
				},
				{
					"Source":
					{
						"Text": "Array of tags that can be used for grouping and categorizing."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3108274284"
				},
				{
					"Source":
					{
						"Text": "Array of tags that can be used for grouping and categorizing. Can also be accessed from scripting."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2800876171"
				},
				{
					"Source":
					{
						"Text": "Assuming 0 is the bottom, and 1 is the top of his capsule... where we ignroe IK traces IE: 0.5 would be his center point"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "132296541"
				},
				{
					"Source":
					{
						"Text": "AttachToOtherCharacter() was used. Use DetachFromOtherCharacter() to set false."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2148427186"
				},
				{
					"Source":
					{
						"Text": "Base eye height above collision center."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "124855742"
				},
				{
					"Source":
					{
						"Text": "CD: Disable all health gain from harvesting"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3609556333"
				},
				{
					"Source":
					{
						"Text": "CD: Enable using GroundConforming in AnimationBP"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2622523652"
				},
				{
					"Source":
					{
						"Text": "CD: Prevent any Buffs with these Tags, checks against CustomTag and (Actor)Tags\nthese are used as a hotfix to store some weight reduction genetrait stuff for faster access"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3574419879"
				},
				{
					"Source":
					{
						"Text": "CD: Use additional UI buttons by setting index to 0, 1, 2 for buttons 4, 5 and 6"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "155287692"
				},
				{
					"Source":
					{
						"Text": "CD: Use mesh from skin applied skin as painting mesh"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2925287988"
				},
				{
					"Source":
					{
						"Text": "CD: by default we don't update PPBlends when riding a vehicle, set this to true to enable PP updates"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2391403970"
				},
				{
					"Source":
					{
						"Text": "CD: by default we override the dinos MaxStepHeight to use the same value as the nav agent they use to match the navmesh, set this to true to prevent that."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3550977525"
				},
				{
					"Source":
					{
						"Text": "CD: force to skip pathfinding and use straight paths"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "225352494"
				},
				{
					"Source":
					{
						"Text": "CD: holds death animations, can be anim sequence, montage or blendspace, name can be used to pick fitting death anim for each case like Idle, Walking, Falling, Swimming, etc"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3146911652"
				},
				{
					"Source":
					{
						"Text": "CD: if enabled will call OnCharacterSteppedUp() notify function when the character does a step up"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1621987999"
				},
				{
					"Source":
					{
						"Text": "CD: last time this actor was ticked via realtime throttled tick"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1445804801"
				},
				{
					"Source":
					{
						"Text": "CD: true if the character has been dragged once while either dead or sleeping, only resets on unsleep"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1659976069"
				},
				{
					"Source":
					{
						"Text": "Can't be moved to sparse data: modified at runtime"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2580862266"
				},
				{
					"Source":
					{
						"Text": "Can't be moved to sparse data: modified at runtime\n Called when this character took lethal damage, just before death"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3078063022"
				},
				{
					"Source":
					{
						"Text": "Controller of the last Actor that caused us damage."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2023409786"
				},
				{
					"Source":
					{
						"Text": "Controls how to handle spawning this actor in a situation where it's colliding with something else. \"Default\" means AlwaysSpawn here."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2469562264"
				},
				{
					"Source":
					{
						"Text": "DEBUG_PHYSICS_BODY - Uncomment Below\nUPROPERTY(Transient, Replicated)\nTArray<FVector_NetQuantize> BodiesPositions;\nDEBUG_DEDICATED_BONES - Uncomment Below\nUPROPERTY(Transient, Replicated)\nTArray<FVector_NetQuantize> BonesPositions;"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3361456400"
				},
				{
					"Source":
					{
						"Text": "Default class to use when pawn is controlled by AI."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1113059160"
				},
				{
					"Source":
					{
						"Text": "Default crouched eye height"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "620405875"
				},
				{
					"Source":
					{
						"Text": "Dormancy setting for actor to take itself off of the replication list without being destroyed on clients."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "884219064"
				},
				{
					"Source":
					{
						"Text": "Enables debug draw for melee attack swings (editor-only)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3744902157"
				},
				{
					"Source":
					{
						"Text": "Force AbsoluteBaseLevel to be the dino's actual spawn level - causes spawners, difficulty, etc. to not modify spawn level."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2039461554"
				},
				{
					"Source":
					{
						"Text": "How long this Actor lives before dying, 0=forever. Note this is the INITIAL value and should not be modified once play has begun."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1084096672"
				},
				{
					"Source":
					{
						"Text": "INSTINCT-ASA :Time for holding space while in water"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "447880875"
				},
				{
					"Source":
					{
						"Text": "If Pawn is possessed by a player, points to its Player State.  Needed for network play as controllers are not replicated to clients."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3625737762"
				},
				{
					"Source":
					{
						"Text": "If actor has valid Owner, call Owner's IsNetRelevantFor and GetNetPriority"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2692244120"
				},
				{
					"Source":
					{
						"Text": "If not empty on spawn, the dino will prioritize these stats when randomly generating base stats"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1657071664"
				},
				{
					"Source":
					{
						"Text": "If not empty on spawn, the dino will put the specified number of points into that base stat before any random stat generation happens.\nThis can stomp the dino's spawn level - eg. if the dino is trying to spawn at level 3, but you have 5 points in stamina here, the dino will be spawned at level 5.\n\nNB: This property is intended to be used by admin cheat commands and is probably not what you want if you're configuring a dino in blueprints."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2722692799"
				},
				{
					"Source":
					{
						"Text": "If set to false (default) given pawn instance will never affect navigation generation (but components could).\nSetting it to true will result in using regular AActor's navigation relevancy\ncalculation to check if this pawn instance should affect navigation generation.\n@note Use SetCanAffectNavigationGeneration() to change this value at runtime.\n@note Modifying this value at runtime will result in any navigation change only if runtime navigation generation is enabled.\n@note Override UpdateNavigationRelevance() to propagate the flag to the desired components.\n@see SetCanAffectNavigationGeneration(), UpdateNavigationRelevance()"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1652560706"
				},
				{
					"Source":
					{
						"Text": "If this dino was spawned by a mission, this is the mission that spawned it"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2506444626"
				},
				{
					"Source":
					{
						"Text": "If true then destroy self when \"finished\", meaning all relevant components report that they are done and no timelines or timers are in flight."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2362172571"
				},
				{
					"Source":
					{
						"Text": "If true, Invokes BPOverrideStencilAllianceForTarget() when PrimalCharacter::UpdateStencilValues() is called for characters viewed by the local player controlling this Dino.\n      Used by the Scout to override the colors of Characters viewed in first person by the scout."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4148691140"
				},
				{
					"Source":
					{
						"Text": "If true, riding this dino will not disable turret mode, and the dino is allowed to move while a player is riding.\nMovement will still be disabled when no player is riding."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2473925075"
				},
				{
					"Source":
					{
						"Text": "If true, the component will be excluded from non-editor builds"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4103190914"
				},
				{
					"Source":
					{
						"Text": "If true, this Pawn's pitch will be updated to match the Controller's ControlRotation pitch, if controlled by a PlayerController."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4158192022"
				},
				{
					"Source":
					{
						"Text": "If true, this Pawn's roll will be updated to match the Controller's ControlRotation roll, if controlled by a PlayerController."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1537164545"
				},
				{
					"Source":
					{
						"Text": "If true, this Pawn's yaw will be updated to match the Controller's ControlRotation yaw, if controlled by a PlayerController."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "482283882"
				},
				{
					"Source":
					{
						"Text": "If true, this actor is only relevant to its owner. If this flag is changed during play, all non-owner channels would need to be explicitly closed."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2815742926"
				},
				{
					"Source":
					{
						"Text": "If true, this actor should search for an owned camera component to view through when used as a view target."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3675254760"
				},
				{
					"Source":
					{
						"Text": "If true, this actor will generate overlap Begin/End events when spawned as part of level streaming, which includes initial level load.\nYou might enable this is in the case where a streaming level loads around an actor and you want Begin/End overlap events to trigger.\n@see UpdateOverlapsMethodDuringLevelStreaming"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2522129499"
				},
				{
					"Source":
					{
						"Text": "If true, this actor will replicate to remote machines\n@see SetReplicates()"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1555156977"
				},
				{
					"Source":
					{
						"Text": "Is this component currently replicating? Should the network code consider it for replication? Owning Actor must be replicating first!"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2620473406"
				},
				{
					"Source":
					{
						"Text": "JH: for inventory UI button use only"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2881104467"
				},
				{
					"Source":
					{
						"Text": "Jira 4885: The Scout in Extinction has to have a normal tick to \"tag\" things in MP."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1236982261"
				},
				{
					"Source":
					{
						"Text": "Jump key Held Time.\nThis is the time that the player has held the jump key, in seconds."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1429502004"
				},
				{
					"Source":
					{
						"Text": "Local space pivot offset for the actor, only used in the editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2778313783"
				},
				{
					"Source":
					{
						"Text": "Max distance to draw the healthbar (0.0 = infinite)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1594612169"
				},
				{
					"Source":
					{
						"Text": "Minimum Player distance to allow replenishing. if any live player is closer than this, it should not replenish."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2587095138"
				},
				{
					"Source":
					{
						"Text": "Pawn responsible for damage and other gameplay events caused by this actor. //PRIMAL - Savegame property added"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4287282395"
				},
				{
					"Source":
					{
						"Text": "Priority for this actor when checking for replication in a low bandwidth or saturated situation, higher priority means it is more likely to replicate"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3316407686"
				},
				{
					"Source":
					{
						"Text": "Raymondm - 50/50 Track how long this object has been at zero zero."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4134101667"
				},
				{
					"Source":
					{
						"Text": "Replicated,"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "882038493"
				},
				{
					"Source":
					{
						"Text": "Represents the current number of jumps performed before CheckJumpInput modifies JumpCurrentCount.\nThis is set in CheckJumpInput and is used in SetMoveFor and PrepMoveFor instead of JumpCurrentCount\nsince CheckJumpInput can modify JumpCurrentCount.\nWhen providing overrides for these methods, it's recommended to either manually\nset this value, or call the Super:: method."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1886727563"
				},
				{
					"Source":
					{
						"Text": "Same as the player setting above, but checking for Structures."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2198517402"
				},
				{
					"Source":
					{
						"Text": "Set by character movement to specify that this Character is currently crouched."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4020676473"
				},
				{
					"Source":
					{
						"Text": "TW - This is not serialized to avoid constant dirtying of unmoving characters to improve save deltas (see usage of LastInAllyRangeSerialized below)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1175395048"
				},
				{
					"Source":
					{
						"Text": "The GUID for this actor's content bundle."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1851541098"
				},
				{
					"Source":
					{
						"Text": "The GUID for this actor; this guid will be the same for actors from instanced streaming levels.\n@see         ActorInstanceGuid, FActorInstanceGuidMapper\n@note        Don't use VisibleAnywhere here to avoid getting the CPF_Edit flag and get this property reset when resetting to defaults.\n                     See FActorDetails::AddActorCategory and EditorUtilities::CopySingleProperty for details."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1518010145"
				},
				{
					"Source":
					{
						"Text": "The base maximum time after the resource is hidden by depletion, to replenish it. the actual replenishment time will be random between the minimum and maximum time."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "563679881"
				},
				{
					"Source":
					{
						"Text": "The base minimum time after the resource is hidden by depletion, to replenish it."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2482245641"
				},
				{
					"Source":
					{
						"Text": "The buff that is currently overriding this dino's colorization"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "579107771"
				},
				{
					"Source":
					{
						"Text": "The instance GUID for this actor; this guid will be unique for actors from instanced streaming levels.\n@see         ActorGuid\n@note        This is not guaranteed to be valid during PostLoad, but safe to access from RegisterAllComponents."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2785505713"
				},
				{
					"Source":
					{
						"Text": "The max number of jumps the character can perform.\nNote that if JumpMaxHoldTime is non zero and StopJumping is not called, the player\nmay be able to perform and unlimited number of jumps. Therefore it is usually\nbest to call StopJumping() when jump input has ceased (such as a button up event)."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4243217458"
				},
				{
					"Source":
					{
						"Text": "The max time the jump key can be held.\nNote that if StopJumping() is not called before the max jump hold time is reached,\nthen the character will carry on receiving vertical velocity. Therefore it is usually\nbest to call StopJumping() when jump input has ceased (such as a button up event)."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "79431527"
				},
				{
					"Source":
					{
						"Text": "The scale to apply to any billboard components in editor builds (happens in any WITH_EDITOR build, including non-cooked games)."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1837566985"
				},
				{
					"Source":
					{
						"Text": "The time this actor was created, relative to World->GetTimeSeconds().\nSee: UWorld::GetTimeSeconds()"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1811807090"
				},
				{
					"Source":
					{
						"Text": "This buff will be given to all characters when they set this dino as a dynamic base"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "231237832"
				},
				{
					"Source":
					{
						"Text": "This should exponentially alter the strength of ehe affect on the exhaustion for calculating the replenishing time."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1833473850"
				},
				{
					"Source":
					{
						"Text": "This should increase the calculated replenishment interval by how often the resource has been depleted within\n      the specified time interval. The idea being that if you are continually harvesting a resource over and over again,\n      it'll take longer to replenish next time. value of zero (Default) means don't use it."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1705428217"
				},
				{
					"Source":
					{
						"Text": "This should linearly alter the strength of the effect on the exhaustion for calculating the replenishing time."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2040111844"
				},
				{
					"Source":
					{
						"Text": "This would decrease the current Exhausted affect - amount at this rate, to gradually restore the resource replenishment speed to normal."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3283833255"
				},
				{
					"Source":
					{
						"Text": "Track last time a jump force started for a proxy."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3884458649"
				},
				{
					"Source":
					{
						"Text": "Tracks the current number of jumps performed.\nThis is incremented in CheckJumpInput, used in CanJump_Implementation, and reset in OnMovementModeChanged.\nWhen providing overrides for these methods, it's recommended to either manually\nincrement / reset this value, or call the Super:: method."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4099397509"
				},
				{
					"Source":
					{
						"Text": "Tracks whether or not the character was already jumping last frame."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1934044583"
				},
				{
					"Source":
					{
						"Text": "Unique dinos can only be uploaded/download once"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4167671071"
				},
				{
					"Source":
					{
						"Text": "Used for replicating attachment of this actor's RootComponent to another actor.\nThis is filled in via GatherCurrentMovement() when the RootComponent has an AttachParent."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3513926691"
				},
				{
					"Source":
					{
						"Text": "WC-AS: If true, will call BP_ModifyInputAcceleration() at the end of ConstrainInputAcceleration(), which allows overriding the input acceleration on the Server and Autonomous Proxies."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4046805092"
				},
				{
					"Source":
					{
						"Text": "When true the replication system will only replicate the registered subobjects and the replicated actor components list\nWhen false the replication system will instead call the virtual ReplicateSubobjects() function where the subobjects and actor components need to be manually replicated."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1620760942"
				},
				{
					"Source":
					{
						"Text": "When true the replication system will only replicate the registered subobjects list\nWhen false the replication system will instead call the virtual ReplicateSubObjects() function where the subobjects need to be manually replicated."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1548554054"
				},
				{
					"Source":
					{
						"Text": "When true, applying updates to network client (replaying saved moves for a locally controlled character)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3235913296"
				},
				{
					"Source":
					{
						"Text": "When true, player wants to jump"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "311314560"
				},
				{
					"Source":
					{
						"Text": "Whether the component is activated at creation or must be explicitly activated."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2321112607"
				},
				{
					"Source":
					{
						"Text": "Whether this actor can take damage. Must be true for damage events (e.g. ReceiveDamage()) to be called.\n@see https://www.unrealengine.com/blog/damage-in-ue4\n@see TakeDamage(), ReceiveDamage()"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1159052997"
				},
				{
					"Source":
					{
						"Text": "Whether this actor should be considered or not during HLOD generation."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4230705398"
				},
				{
					"Source":
					{
						"Text": "Which regions allow replacing the color with the dye UI"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1437705341"
				},
				{
					"Source":
					{
						"Text": "[Only used on server] If non-null, this is the currently playing montage that is having its timing synced with the server"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2795169284"
				},
				{
					"Source":
					{
						"Text": "[Server Only] Override hit marker indicator for the player that did damage to this character"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "495179581"
				},
				{
					"Source":
					{
						"Text": "a dino character mounted on this character (used with monkey)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4228467955"
				},
				{
					"Source":
					{
						"Text": "a parent's reference to it's followers"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2571258747"
				},
				{
					"Source":
					{
						"Text": "a wild follower's reference to it's parent"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1726667668"
				},
				{
					"Source":
					{
						"Text": "animation played on death"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3642321379"
				},
				{
					"Source":
					{
						"Text": "component space instead of world space"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1490719131"
				},
				{
					"Source":
					{
						"Text": "excluded from sparse data - likely modified at runtime"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "39197314"
				},
				{
					"Source":
					{
						"Text": "excluded from sparse data - likely to be modified at runtime"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1488347893"
				},
				{
					"Source":
					{
						"Text": "excluded from sparse data - modified at runtime"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2774980960"
				},
				{
					"Source":
					{
						"Text": "excluded from sparse data because it involves a struct and there was one instance of child BPs crashing involving an array of structs"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3398944216"
				},
				{
					"Source":
					{
						"Text": "fill out the entries for setting a % chance for children/follower dinos to spawn in the wild"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1854414309"
				},
				{
					"Source":
					{
						"Text": "for testing purposes"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1563183696"
				},
				{
					"Source":
					{
						"Text": "if true, BPOverrideFPVViewLocation() and BPGetFPVViewLocation() will be called to allow the dino to overload the camera location.\nNecessary because bBPManagedFPVViewLocation only works if you have a rider."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2260259174"
				},
				{
					"Source":
					{
						"Text": "jorgem: Enables the BP implementable functions BP_OnBasedPawnAddedToSet and BP_OnBasedPawnRemovedFromSet"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "4000629993"
				},
				{
					"Source":
					{
						"Text": "marks if it was a wild follower initially"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3624991104"
				},
				{
					"Source":
					{
						"Text": "modifier for max movement speed"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1569285560"
				},
				{
					"Source":
					{
						"Text": "sound played on death, local player only"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3697235212"
				},
				{
					"Source":
					{
						"Text": "sound played when running"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1203239473"
				},
				{
					"Source":
					{
						"Text": "sound played when stop running"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "2252494122"
				},
				{
					"Source":
					{
						"Text": "the randomly generated age to keep the wild follower as"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "1809448498"
				},
				{
					"Source":
					{
						"Text": "this is strictly for replicating to guess the time of destruction"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "561408961"
				},
				{
					"Source":
					{
						"Text": "this replicates to players whether it can be imprinted"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "141365556"
				},
				{
					"Source":
					{
						"Text": "virtual void OnRegister() override;"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3657794503"
				}
			]
		}
	]
}